'''Modules are for building your view.

Класс ViewBuilder, рассположенный в viewbuilder.py, определяет какой 
класс будут использоваться для построения структуры расположения окон, 
которые отображают полотна с графикой, элементы взаимодействия и другое.
Также он содержит класс, который помогает в построении полотен, на которых 
будет изображена графика. 

Класс View расположеный в view.py представляет логику и определяет 
в каком месте будет отображаться графика.

В папке protocols содержатся файлы описывающие по протоколам используемые классы. 
'''